In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
dframe = pd.read_csv("D:\lec25.csv")

In [5]:
dframe

   q   r   s   t    apple
0  2   3   4   5     pear
1  a   s   d   f   rabbit
2  5   2   5   7      dog

In [7]:
dframe = pd.read_csv("D:\lec25.csv", header = None)

In [9]:
dframe

   0   1   2   3        4
0  q   r   s   t    apple
1  2   3   4   5     pear
2  a   s   d   f   rabbit
3  5   2   5   7      dog

In [15]:
dframe = pd.read_table("D:\lec25.csv", sep =',', header = None)
dframe

   0   1   2   3        4
0  q   r   s   t    apple
1  2   3   4   5     pear
2  a   s   d   f   rabbit
3  5   2   5   7      dog

In [17]:
pd.read_csv("D:\lec25.csv",header = None, nrows = 2)

   0   1   2   3       4
0  q   r   s   t   apple
1  2   3   4   5    pear

In [19]:
dframe

   0   1   2   3        4
0  q   r   s   t    apple
1  2   3   4   5     pear
2  a   s   d   f   rabbit
3  5   2   5   7      dog

In [25]:
dframe.to_csv('mytextdata_out.csv') 
#THIS IS USED TO EXPORT THE DATA THAT WE ARE HAVING NOW INTO A 'CSV' FILE.

In [27]:
import sys

In [31]:
dframe.to_csv(sys.stdout)
#THIS IS USED TO NOT ACTUALLY SAVING THIS FILE BUT SHOWING THE OUTPUT

,0,1,2,3,4
0,q, r, s, t, apple
1,2, 3, 4, 5, pear
2,a, s, d, f, rabbit
3,5, 2, 5, 7, dog

In [41]:
dframe.to_csv(sys.stdout, sep = '_')

_0_1_2_3_4
0_q_ r_ s_ t_ apple
1_2_ 3_ 4_ 5_ pear
2_a_ s_ d_ f_ rabbit
3_5_ 2_ 5_ 7_ dog

In [43]:
dframe.to_csv(sys.stdout,sep = '?')

?0?1?2?3?4
0?q? r? s? t? apple
1?2? 3? 4? 5? pear
2?a? s? d? f? rabbit
3?5? 2? 5? 7? dog

In [45]:
dframe.to_csv(sys.stdout, columns = [0, 1, 2])

,0,1,2
0,q, r, s
1,2, 3, 4
2,a, s, d
3,5, 2, 5